data_generation/simulation_results/openfoam/case_69/constant/pcb/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/pcb/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    empty
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          1372;
        startFace       1213;
    }
    pcb_to_component_4
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          68;
        startFace       2585;
        sampleMode      nearestPatchFace;
        sampleRegion    component_4;
        samplePatch     component_4_to_pcb;
    }
    pcb_to_component_2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          18;
        startFace       2653;
        sampleMode      nearestPatchFace;
        sampleRegion    component_2;
        samplePatch     component_2_to_pcb;
    }
    pcb_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          140;
        startFace       2671;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_pcb;
    }
    pcb_to_component_0
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          40;
        startFace       2811;
        sampleMode      nearestPatchFace;
        sampleRegion    component_0;
        samplePatch     component_0_to_pcb;
    }
    pcb_to_component_3
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          18;
        startFace       2851;
        sampleMode      nearestPatchFace;
        sampleRegion    component_3;
        samplePatch     component_3_to_pcb;
    }
    pcb_to_component_1
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          34;
        startFace       2869;
        sampleMode      nearestPatchFace;
        sampleRegion    component_1;
        samplePatch     component_1_to_pcb;
    }
)

// ************************************************************************* //
