data_generation/simulation_results/openfoam/case_69/constant/simParams
nIter 2000;
hComponent0 526.8363034488424;
hComponent1 587.6780881898293;
hComponent2 790.1908721304102;
hComponent3 1393.9042249573802;
hComponent4 736.3052793575735;kComponent0 56.47722504932872;
kComponent1 65.01461700027448;
kComponent2 96.80017122502643;
kComponent3 16.366832202753137;
kComponent4 13.243841525814311;
tAmbient 300;
Ux 2.7498689170197936;
kPCB 0.11268080596213079;